detection:
  condition: selection and not 1 of filter_main_*
  filter_main_svchost:
    Image|endswith: :\windows\system32\svchost.exe
    User|contains:
    - AUTHORI
    - AUTORI
  selection:
    TargetFilename|contains: :\Windows\Prefetch\
    TargetFilename|endswith: .pf
id: 0a1f9d29-6465-4776-b091-7f43b26e4c89
logsource:
  category: file_delete
  product: windows
